src/cf/DocumentJournals/ДокументыПоОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыПоОС</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ПринятиеКУчетуОС</xr:Item>
				<xr:Item>Document.МодернизацияОС</xr:Item>
				<xr:Item>Document.ПеремещениеОС</xr:Item>
				<xr:Item>Document.ПодготовкаКПередачеОС</xr:Item>
				<xr:Item>Document.СписаниеОС</xr:Item>
				<xr:Item>Document.ПередачаОС</xr:Item>
				<xr:Item>Document.ИнвентаризацияОС</xr:Item>
				<xr:Item>Document.ПередачаОборудованияВМонтаж</xr:Item>
				<xr:Item>Document.АвизоОСВходящее</xr:Item>
				<xr:Item>Document.АвизоОСИсходящее</xr:Item>
				<xr:Item>Document.ВыкупПредметовЛизинга</xr:Item>
				<xr:Item>Document.ПередачаОСВАренду</xr:Item>
				<xr:Item>Document.ВозвратОСОтАрендатора</xr:Item>
				<xr:Item>Document.ПоступлениеВАренду</xr:Item>
				<xr:Item>Document.ИзменениеУсловийАренды</xr:Item>
				<xr:Item>Document.ПереводОСВМалоценноеОборудование</xr:Item>
				<xr:Item>Document.ОбесценениеОС</xr:Item>
				<xr:Item>Document.ПрекращениеАренды</xr:Item>
				<xr:Item>Document.СчетНаОплатуПокупателю</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПередачаОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПередачаОборудованияВМонтаж.Attribute.Организация</xr:Item>
						<xr:Item>Document.АвизоОСВходящее.Attribute.Организация</xr:Item>
						<xr:Item>Document.АвизоОСИсходящее.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВыкупПредметовЛизинга.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПередачаОСВАренду.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.Организация</xr:Item>
						<xr:Item>Document.ИзменениеУсловийАренды.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступлениеВАренду.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПереводОСВМалоценноеОборудование.Attribute.Организация</xr:Item>
						<xr:Item>Document.ОбесценениеОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПрекращениеАренды.Attribute.Организация</xr:Item>
						<xr:Item>Document.СчетНаОплатуПокупателю.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<References>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.ОбъектСтроительства</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.ОбъектСтроительства</xr:Item>
						<xr:Item>Document.ПередачаОборудованияВМонтаж.Attribute.ОбъектСтроительства</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СобытиеОС</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПередачаОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.АвизоОСВходящее.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.АвизоОСИсходящее.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ВыкупПредметовЛизинга.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПередачаОСВАренду.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПереводОСВМалоценноеОборудование.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ОбесценениеОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПрекращениеАренды.Attribute.СобытиеОС</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПередачаОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПередачаОборудованияВМонтаж.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АвизоОСВходящее.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АвизоОСИсходящее.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ВыкупПредметовЛизинга.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПередачаОСВАренду.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПоступлениеВАренду.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ИзменениеУсловийАренды.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПереводОСВМалоценноеОборудование.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ОбесценениеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПрекращениеАренды.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.СчетНаОплатуПокупателю.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПередачаОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПередачаОборудованияВМонтаж.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АвизоОСВходящее.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АвизоОСИсходящее.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ВыкупПредметовЛизинга.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПередачаОСВАренду.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПоступлениеВАренду.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ИзменениеУсловийАренды.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПереводОСВМалоценноеОборудование.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ОбесценениеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПрекращениеАренды.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.СчетНаОплатуПокупателю.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<References>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.СписаниеОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПередачаОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПередачаОборудованияВМонтаж.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ВыкупПредметовЛизинга.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПередачаОСВАренду.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПоступлениеВАренду.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ИзменениеУсловийАренды.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПереводОСВМалоценноеОборудование.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ОбесценениеОС.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПрекращениеАренды.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.РучнаяКорректировка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидОперации</Name>
					<References>
						<xr:Item>Document.ИзменениеУсловийАренды.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.ПоступлениеВАренду.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.СчетНаОплатуПокупателю.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.ВидОперации</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеЗемельныхУчастков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаКомиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиЛизинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиФакторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийСчетаПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСчетаПокупателю</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварыИУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DocumentJournals/ДокументыПоОС/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальныеКоманды;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОсновнаяОрганизация           = Справочники.Организации.ОрганизацияПоУмолчанию();
	ОтборОрганизация              = ОсновнаяОрганизация;
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	АдресХранилищаНастройкиДинСпискаДляРеестра = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПомеченныеНаУдалениеСервер.СкрытьПомеченныеНаУдаление(ЭтотОбъект);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы,
					"СписокКонтекстноеМенюСоздатьПоПараметруСчетНаОплатуПокупателю",
					"Видимость",
					Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы,
					"СписокКонтекстноеМенюСоздатьПоПараметруПоступлениеТоваровУслуг",
					"Видимость",
					Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы,
					"ФормаСоздатьПоПараметруСчетНаОплатуПокупателю",
					"Видимость",
					Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы,
					"ФормаСоздатьПоПараметруПоступлениеТоваровУслуг",
					"Видимость",
					Ложь);
	
	Если Элементы.Найти("ФормаСоздать") <> Неопределено Тогда
		ОбщегоНазначенияБЭД.ПереместитьЭлемент(Элементы,
					"ФормаСоздатьСчетНаОплатуПокупателюОС", "СписокКонтекстноеМенюСоздать",
					"СписокКонтекстноеМенюСоздатьПоПараметруСчетНаОплатуПокупателю");
		ОбщегоНазначенияБЭД.ПереместитьЭлемент(Элементы,
					"ФормаСоздатьПоступлениеОС", "СписокКонтекстноеМенюСоздать",
					"СписокКонтекстноеМенюСоздатьПоПараметруПоступлениеТоваровУслуг");
		ОбщегоНазначенияБЭД.ПереместитьЭлемент(Элементы,
					"ФормаСоздатьСчетНаОплатуПокупателюОС1", "ФормаСоздать",
					"ФормаСоздатьПоПараметруСчетНаОплатуПокупателю");
		ОбщегоНазначенияБЭД.ПереместитьЭлемент(Элементы,
					"ФормаСоздатьПоступлениеОС1", "ФормаСоздать",
					"ФормаСоздатьПоПараметруПоступлениеТоваровУслуг");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы,
					"ФормаСоздатьПоступлениеОС",
					"Видимость",
					Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы,
					"ФормаСоздатьПоступлениеОС1",
					"Видимость",
					Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы,
					"ФормаСоздатьСчетНаОплатуПокупателюОС",
					"Видимость",
					Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы,
					"ФормаСоздатьСчетНаОплатуПокупателюОС1",
					"Видимость",
					Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		
		ОсновнаяОрганизация = Параметр;
		Если ОсновнаяОрганизация <> ОтборОрганизация Тогда
			ОтборОрганизация                 = ОсновнаяОрганизация;
			ОтборОрганизацияИспользование    = ЗначениеЗаполнено(ОтборОрганизация);
			ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
			ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПоказатьИнформациюОПравеПримененияСпецрежима" Тогда
		
		Если Источник <> ЭтотОбъект И (Не ОтборОрганизацияИспользование Или Параметр = ОтборОрганизация) Тогда
			ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	СтруктураОтбора = Неопределено;
	Если Параметры.Свойство("Отбор", СтруктураОтбора) И ЗначениеЗаполнено(СтруктураОтбора) Тогда
		
		Если СтруктураОтбора.Свойство("Организация") И ЗначениеЗаполнено(СтруктураОтбора.Организация) Тогда
			ОтборОрганизация = СтруктураОтбора.Организация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
			Параметры.Отбор.Удалить("Организация");
		КонецЕсли;
		
	Иначе
		Если ОтборОрганизация <> ОсновнаяОрганизация Тогда
			ОтборОрганизация = ОсновнаяОрганизация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		ИначеЕсли Не ОтборОрганизацияИспользование Тогда
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		КонецЕсли;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НапомнитьПозжеНажатие(Элемент)
	
	ОтложитьПоказНапоминанияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееНажатие(Элемент)
	
	КонтрольПраваПримененияСпецрежимаКлиент.ПодробнееНажатие(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	Оповестить("ПоказатьИнформациюОПравеПримененияСпецрежима",
		?(ОтборОрганизацияИспользование, ОтборОрганизация, Неопределено),
		ЭтотОбъект);
	
	ПомеченныеНаУдалениеКлиент.ПриИзмененииСписка(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ОбщегоНазначенияБП.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	
	ОтборыСписков.СброситьИспользованиеПользовательскихОтборовВНастройке(Настройки);
	
	ПомеченныеНаУдалениеСервер.УдалитьОтборПометкаУдаления(Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкиДинамическогоСписка()
	
	Отчеты.РеестрДокументов.НастройкиДинамическогоСписка(ЭтотОбъект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	Если УправлениеПечатьюБПКлиентСервер.ЭтоИмяКомандыРеестрДокументов(Команда.Имя) Тогда
		НастройкиДинамическогоСписка();
	КонецЕсли;
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ПравоПримененияСпецрежима

&НаКлиенте
Процедура ПоказатьИнформациюОПравеПримененияСпецрежима()
	
	Если Не ОтборОрганизацияИспользование
		Или Не КонтрольПраваПримененияСпецрежимаКлиент.Контролировать(ОтборОрганизация) Тогда
		Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
	Иначе
		ПоказатьИнформациюОПравеПримененияСпецрежимаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьИнформациюОПравеПримененияСпецрежимаНаСервере()
	
	ИнформацияОПравеПримененияСпецрежима = КонтрольПраваПримененияСпецрежима.ИнформацияОПравеПримененияСпецрежима(
		ОтборОрганизация, 
		КонтрольПраваПримененияСпецрежима.ИмяПоказателяСпецрежимаОсновныеСредства());
	СледующееЗначениеНапоминания         = ИнформацияОПравеПримененияСпецрежима.СледующееЗначениеНапоминания;
	СсылкаНаПояснение                    = ИнформацияОПравеПримененияСпецрежима.СсылкаНаПояснение;
	
	Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = ИнформацияОПравеПримененияСпецрежима.Показать;
	Элементы.ИнформацияОПравеПримененияСпецрежима.ЦветФона = ИнформацияОПравеПримененияСпецрежима.ЦветФонаГруппы;
	Элементы.ТекстИнформации.Заголовок = ИнформацияОПравеПримененияСпецрежима.ТекстИнформации;
	
	Элементы.Подробнее.Видимость       = ЗначениеЗаполнено(СсылкаНаПояснение);
	
	Элементы.НапомнитьПозже.Заголовок  = ИнформацияОПравеПримененияСпецрежима.ТекстНапомнитьПозже;
	Элементы.НапомнитьПозже.Видимость  = ИнформацияОПравеПримененияСпецрежима.ОтображатьНапоминание;
	
КонецПроцедуры

&НаСервере
Процедура ОтложитьПоказНапоминанияНаСервере()
	
	КонтрольПраваПримененияСпецрежима.ОтложитьПоказНапоминания(
		ОтборОрганизация,
		КонтрольПраваПримененияСпецрежима.ИмяПоказателяСпецрежимаОсновныеСредства(),
		СледующееЗначениеНапоминания);
		
	Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеОС(Команда)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормыПоступлениеТоваровУслугОсновныеСредства");
	
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", 
	Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ОсновныеСредства"))), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетНаОплатуПокупателюОС(Команда)
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормыСчетНаОплатуПокупателюОсновныеСредства");
	
	ОткрытьФорму("Документ.СчетНаОплатуПокупателю.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", 
	Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийСчетаПокупателю.ОсновныеСредства"))), ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
